---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HeavyEndPen
source: html/cbf794ed-681c-837f-3d7d-7cb5ff04e5d3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HeavyEndPen Property

"Heavy End Pen Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId HeavyEndPen { get; }
```